{"home":"Hey there, hope you are having a great day. My name is Ashish. I am a full-stack web developer, and currently working as a full-time employee in Hitchi Vantara. I have a total 6+ years of experience in IT (Mostly in Java, React(1+ year) and related technologies). This site is developed on React (16.13.1). I love to learn new technologies, code, play carrom & chess. I engross myself with anything new that comes in market and always try to upgrade my skills. So, you might find me geeky sometime as I love to talk about them too. I love to travel and explore new places. I am self-guided and self-motivated person and never believe in something quickly or unless I test it myself. I like algorithms and data-structure and always try to implement something in efficient way, whether it be in my job or life. Use this site to expore more. Thanks for visiting. ","careerPath":"I started my career as a Java back-end developer. I was working in Tata Consultancy Services for a leading telecom client. So, JSP were used widely in my project and it gave me exposure to maintaining sessions, preventing CSRF attacks etc. As the applications were very old (Struts 1 and 2 based) and deployed on application server. I got to know more about the underlying flow of huge applications running on application servers and how the multi-threading and thread-pooling concept were implemented using JNDI. As I kept learning the new in market, the technologies that really surprised me was Spring and Springboot. I got to implement on schedular with my 2+ years of experience and I used Spring schedular. A good company of seniors helped me get exposure. Yeah, I got lucky in that. Later, I changed my company and started working for a Swiss-based leading bank client. The applications were old but very vast and they had started the migration some comparatively small modules to new technologies in market (like Angular 6+ and React) and Spring for the backend. I got to learn new design patterns there. The applications were comparatively hard to explore, but my collegues helped me understand the code for first few days. Later, I got expertise in that. This experience helped to build the confidence to understand any new application. I joined Hitachi Consulting, now Hitachi Vantara, in 2019. Here, I worked on multiple projects and multiple technologies like JAVA 8+, Angular and frameworks like dropwizard, spring, servlets too and I am happy that I always got what I wanted. Yes, Spring and SpringBoot and React. I am currently working in two projects concurrently as fullstack developer and I am handeling a small team (4 people) in one of the project."}
