{"home":"Welcome to my portfolio. I hope you are having a great day. My name is Ashish Karn, and I am a seasoned full-stack web developer. Currently, I am employed full-time at BNY Mellon, where I have been honing my skills for the past several years. With over 8 years of experience in the industry, I have a wealth of knowledge and expertise to offer. \n My passion for programming is fueled by a desire to stay up-to-date with the latest technologies and trends. I am constantly learning and striving to improve my skills. In addition to my work as a web developer, I enjoy playing carrom and chess in my free time.\n \t I find working with algorithms and data structures to be particularly rewarding, and I always strive to implement them in the most efficient way possible. Please feel free to explore my site to learn more about me and my work. Thank you for taking the time to visit.","careerPath1":"I began my career as a developer at Tata Consultancy Services, working with a leading Telecom client where EJB and JSP were used extensively. This project exposed me to session management, CSRF attack prevention, Hibernate theories and other key aspects that are now commonly wrapped within frameworks. As the applications were built on legacy stacks such as Struts 1 and 2 and deployed on application servers, I gained an understanding of the underlying flow of large-scale applications running on application servers, including concepts like JNDI and Connection Pool. I was fascinated by how multi-threading and thread-pooling concepts were implemented to ensure efficient large-scale systems. Although these concepts are now considered obsolete with the introduction of the reactive paradigm, I believe we can create something even more efficient and robust. \n As I continued to learn about new tech stacks, I was particularly impressed with Spring, Springboot, and now, Spring-reactive. I have implemented schedulers and Spring Batch applications with the help of senior colleagues who provided guidance and mentorship. Later on, I explored opportunities with other organizations and began working for Cognizant for a leading Swiss-based bank. The applications were old and vast, but they had started migrating some small modules to newer technologies of the time, such as Angular 6+, ReactJS, and SpringBoot for backend business module-based microservices. During this time, I learned new design patterns such as the Command Design Pattern. Although the applications were challenging to explore initially, over time, I gained a better understanding of the code. This experience helped me build the confidence to understand any new application. \n","careerPath2": "In May 2019, I started working at Hitachi Vantara (formerly Hitachi Consulting), where I worked on multiple projects and used various technologies such as JAVA 8+, Angular, and frameworks like Dropwizard, Spring, Servlets, SpringBoot, ReactJS, Kafka, Avro, and microservices. I have been instrumental in building large-scale, robust, and reliable applications, ultimately delivering the most efficient solutions to meet business requirements. \n ","careerPath3": "In April 2021, I was blessed with the arrival of my baby boy. Despite the challenges posed by the second wave of COVID-19, my organization was incredibly supportive and provided me with the time I needed to celebrate with my family and colleagues.\n \n ","careerPath4": "In August 2021, I fulfilled a long-held dream of joining JP Morgan & Chase as an Associate (Full Stack Java Developer). Due to the pandemic, they offered me remote work, which enabled me to achieve a better work-life balance and spend more time with my family, especially my newborn son. The project involved processing high-volume transaction trade feeds and reporting, and I was able to work with the latest technologies and contribute to the migration aspect of the project. The new system utilized Kafka and SpringBoot for feed processing and reporting to trade reporting venues. Although I eventually became comfortable with the application, I decided to resign when the office resumed in-person work and I did not want to move to Mumbai with my family during the post-pandemic period, considering the well-being of my young child. ","careerPath5": "In May 2022, I joined BNY Mellon, a fantastic organization with great colleagues and employee benefits. Initially, I was open to the possibility of working in the office, but my wife, Sukanya, received a job offer that required us to move to Bangalore. Given that I mostly had a work-from-home scenario and there were no plans to recall employees to the office, we decided to make the move. However, the company is now requiring employees to return to the office 20 days per quarter, and I am actively seeking a role that would enable me to continue working in Bangalore."}
