{"home":"Thank you for visiting my portfolio. I hope you are having a great day. My name is Ashish Karn. I am a full-stack web developer, and currently working as a full-time employee in JP Morgan. I have a total 7+ years of experience in the Industry. I love to learn new technologies, code, play carrom & chess. I engross myself with anything new and always try to upgrade my skills. I am self-guided and self-motivated person and never believe in something quickly or unless I test it myself. I like algorithms and data-structure and always try to implement something in efficient way, whether it be in my job or life. Use this site to expore more. Thank you again for visiting. ","careerPath":"I started my career as a Full-stack developer but mostly working on back-end technologies. I worked in Tata Consultancy Services for a leading telecom client. So, EJB & JSP were used widely in my project and it gave me exposure to maintaining sessions, preventing CSRF attacks and many other aspects which, nowadays, are wrapped within the frameworks. As the applications were very old (Struts 1 and 2 based) and deployed on application server. I got to know more about the underlying flow of huge applications running on application servers with concepts like JNDI, Connection Pool etc, and,also, how the multi-threading and thread-pooling concept were implemented. As I kept learning the new in market, the technologies that really surprised me was Spring and Springboot. I got to implement on schedular with my 2+ years of experience and I used Spring schedular. A good company of seniors helped me get exposure. Later, I changed my company and started working for a Swiss-based leading bank client. The applications were old but very vast and they had started the migration some comparatively small modules to new technologies in market (like Angular 6+ and React) and Spring for the backend. I got to learn new design patterns there. The applications were comparatively hard to explore, but over a period of time I understood the most of the application code. Later, I got expertise in that. This experience helped to build the confidence to understand any new application. I joined Hitachi Vantara (formerly Hitachi Consulting), in May-2019. Here, I worked on multiple projects and multiple technologies like JAVA 8+, Angular and frameworks like dropwizard, spring, servlets too and I am happy that I always got what I wanted. Yes, Spring and SpringBoot and ReactJS, Kafka, Avro, Micro-services and all of this."}
