{"home":"Welcome to my portfolio. I hope you are having a great day. My name is Ashish Karn, and I am a seasoned full-stack web developer. Currently, I am employed full-time at BNY Mellon, where I have been honing my skills for the past several years. With over 8 years of experience in the industry, I have a wealth of knowledge and expertise to offer. \n My passion for programming is fueled by a desire to stay up-to-date with the latest technologies and trends. I am constantly learning and striving to improve my skills. In addition to my work as a web developer, I enjoy playing carrom and chess in my free time.\n \t I find working with algorithms and data structures to be particularly rewarding, and I always strive to implement them in the most efficient way possible. Please feel free to explore my site to learn more about me and my work. Thank you for taking the time to visit.","careerPath":"I started my career with Tata Consultancy Services as a developer and worked for a leading telecom client. So, EJB & JSP were used widely in my project and it gave me exposure to maintaining sessions, preventing CSRF attacks and many other aspects which, nowadays, are wrapped within the frameworks. As the applications were built on legacy stacks (Struts 1 and 2 based) and deployed on application server. I got to know more about the underlying flow of large scale applications running on application servers and ventured concepts like JNDI, Connection Pool etc. Intrigued how the multi-threading and thread-pooling concept were implemented to ensure effecient large scale systems. Although, these are obsolete now with introduction of reactive paradigm, I believe we can create something more effecient and robust. As I kept learning the new tech stacks in market, the technologies that really surprised me was Spring and Springboot and, nowadays, spring-reactive. I got to implement on schedulars and spring batch applications. A good company of seniors helped me get exposure. Later, I explored opportunities with other organisations and started working for a Swiss-based leading bank. The applications were old but very vast and they had started the migration some comparatively small modules to new technologies in market (like Angular 6+ and ReactJS) and SpringBoot for the backend as business module based microservices. I got to learn new design patterns there (Command Design Pattern). The applications were comparatively difficult to explore, but over a period of time I understood the most of the application code. This experience helped to build the confidence to understand any new application. I joined Hitachi Vantara (formerly Hitachi Consulting), in May-2019. Here, I worked on multiple projects and multiple technologies like JAVA 8+, Angular and frameworks like dropwizard, spring, servlets, Spring and SpringBoot and ReactJS, Kafka, Avro, Micro-services and all of this to build a large scale rebust reliable applications and, ultimately, delivering the most efficient solution to the business requirements."}
